# ConSlottedHole

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**angle** | **float** |  | [optional]
**size_factor** | **float** |  | [optional]

## Example

```python
from ideastatica_connection_api.models.con_slotted_hole import ConSlottedHole

# TODO update the JSON string below
json = "{}"
# create an instance of ConSlottedHole from a JSON string
con_slotted_hole_instance = ConSlottedHole.from_json(json)
# print the JSON string representation of the object
print(con_slotted_hole_instance.to_json())

# convert the object into a dict
con_slotted_hole_dict = con_slotted_hole_instance.to_dict()
# create an instance of ConSlottedHole from a dict
con_slotted_hole_from_dict = ConSlottedHole.from_dict(con_slotted_hole_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)